package tools;

import constants.GameConstants;

public class CalcTools
{

  //   装备等级	第 1 层	第 2 层	第 3 层	第 4 层	第 5 层	第 6 层	第 7 层
//    0-39	1%	2.2%	3.63%	5.324%	7.3205%	8.7846%	10.2487%
//     40-79	2%	4.4%	7.26%	10.648%	14.641%	17.5692%	20.4974%
//     80-119	3%	6.6%	10.89%	15.972%	21.9615%	26.3538%	30.7461%
//     120-159	4%	8.8%	14.52%	21.296%	29.282%	35.1384%	40.9948%
//     160-199	5%	11%	18.15%	26.62%	36.6025%	43.923%	51.2435%
//     200+	6%	13.2%	21.78%	31.944%	43.923%	52.7076%	61.4922%
  private static double[][] 普通武器火花百分比表 = new double[][] {
      new double[] { 1.0D, 2.2D, 3.63D, 5.324D, 7.3205D, 8.7846D, 10.2487D, 11.7128D, 13.1769D }, new double[] { 2.0D, 4.4D, 7.26D, 10.648D, 14, 641D, 17.5692D, 20.4974D, 23.4256D, 26.3538D },
      new double[] { 3.0D, 6.6D, 10.89D, 15.972D, 21.9615D, 26.3538D, 30.7461D, 35.1384D, 39.5307D }, new double[] { 4.0D, 8.8D, 14.52D, 21.296D, 29.2820D, 35.1384D, 40.9948D, 46.8512D, 52.7076D },
      new double[] { 5.0D, 11D, 18.15D, 26.62D, 36.6025D, 43.923D, 51.2435D, 58.5640D, 65.8845D }, new double[] { 6.0D, 13.2D, 21.78D, 31.944D, 43.923D, 52.7076D, 61.4922D, 70.2768D, 79.0614 }
  };

  private static double[][] 首領武器火花百分比表 = new double[][] {
      new double[] { 3.0D, 4.4D, 6.05D, 7.986D, 10.2487D, 12.5114D, 14.7741D }, new double[] { 6.0D, 8.8D, 12.1D, 15.972D, 20.4974D, 25.0228D, 29.5482D }, new double[] { 9.0D, 13.2D, 18.15D, 23.958D, 30.7461D, 37.5342D, 44.3223D },
      new double[] { 12.0D, 17.6D, 24.2D, 31.944D, 40.9948D, 50.0456D, 59.0964D }, new double[] { 15.0D, 22.0D, 30.25D, 39.93D, 51.2435D, 62.5570D, 73.8705D }, new double[] { 18.0D, 26.4D, 36.3D, 47.916D, 61.4922D, 75.0684D, 88.6446D },
      };

  public static double 計算武器火花攻擊力 (int 武器Id, int 武器等級, int 火花等級)
  {

    if (GameConstants.isBossItem(武器Id))
    {
      int 火花百分比索引 = 火花等級 - 3;
      if (火花等級 < 3)
      {
        return 0.0D;
      }
      if (武器等級 < 40)
      {
        return 首領武器火花百分比表[0][火花百分比索引];
      }
      else if (武器等級 < 80)
      {
        return 首領武器火花百分比表[1][火花百分比索引];
      }
      else if (武器等級 < 120)
      {
        return 首領武器火花百分比表[2][火花百分比索引];
      }
      else if (武器等級 < 160)
      {
        return 首領武器火花百分比表[3][火花百分比索引];
      }
      else if (武器等級 < 200)
      {
        return 首領武器火花百分比表[4][火花百分比索引];
      }
      else if (武器等級 < 300)
      {
        return 首領武器火花百分比表[5][火花百分比索引];
      }
    }
    else
    {
      int 火花百分比索引 = 火花等級 - 1;
      if (武器等級 < 40)
      {
        return 普通武器火花百分比表[0][火花百分比索引];
      }
      else if (武器等級 < 80)
      {
        return 普通武器火花百分比表[1][火花百分比索引];
      }
      else if (武器等級 < 120)
      {
        return 普通武器火花百分比表[2][火花百分比索引];
      }
      else if (武器等級 < 160)
      {
        return 普通武器火花百分比表[3][火花百分比索引];
      }
      else if (武器等級 < 200)
      {
        return 普通武器火花百分比表[4][火花百分比索引];
      }
      else if (武器等級 < 300)
      {
        return 普通武器火花百分比表[5][火花百分比索引];
      }
    }

    return 0.0D;
  }
}
